/*
 * led.h
 *
 *  Created on: Jan 22, 2018
 *      Author: jerry
 */

#ifndef _LED_H_
#define _LED_H_

#include "my_gpio_driver.h"

/**************************************************************
 函数名：init_gpio_app
 描述：开启gpio入网流水灯;
 参数：@void *:实际参数定义为int time,输入时填写为（void*)&time：流水灯持续时间;
 返回：0成功，-1失败；
**************************************************************/
int init_gpio_app(void*time);

/**************************************************************
函数名：init_gpio_coo_update
描述：开启gpio COO升级指示灯闪烁;
参数：
返回：空
**************************************************************/
void init_gpio_coo_update(void);

/**************************************************************
函数名：closeCooLed
描述：关闭gpio指示灯控制;
参数：
返回：空；
**************************************************************/
void closeCooLed();

/**************************************************************
函数名：set_led_ctrl_flag
描述：设置入网流水灯标志位;
参数：@int num： 入网流水灯标志位，0结束流水灯，1开启流水灯
返回：空；
**************************************************************/
void set_led_ctrl_flag(int num);


/**************************************************************
函数名：get_led_ctrl_flag
描述：获取入网流水灯标志位;
参数：
返回：0流水灯已结束，1流水灯工作状态；
**************************************************************/
int get_led_ctrl_flag();

/**************************************************************
函数名：init_gpio_refactory
描述：启动恢复出厂设置流水灯操作;
参数：空
返回：空；
**************************************************************/
void init_gpio_refactory(void);

/**************************************************************
函数名：resetLed
描述：归还流水灯控制给系统;
参数：空
返回：空；
**************************************************************/
void resetLed();

/**************************************************************
函数名：init_gpio_8s_butten
描述：启动reset按键长按5~10秒钟，led灯操作;
参数：空
返回：空；
**************************************************************/
void init_gpio_8s_butten(void);

/**************************************************************
函数名：init_gpio_wan_wifi_lan
描述：连续快闪两次，用于自定义操作led灯指示；
参数：空
返回：空；
**************************************************************/
void init_gpio_wan_wifi_lan(void);

/**************************************************************
函数名：set_wan_lan_wifi_flag
描述：设置连续快闪两次led灯指示，状态标志位；
参数：int num:0-停止 1-继续
返回：空；
**************************************************************/
void set_wan_lan_wifi_flag(int num);

#ifdef BOARD_U86_GATEWAY
void set_zigbee_led_flag(int num);
void init_gpio_run(void);
#endif

#endif /* INCLUDE_LED_H_ */
